<?php
//TODO::作業途中

//バブルソートを用いた処理
// [バブルソート] nの入力を受け取り、nの要素数を持つランダムな値が入った配列を返却する関数の作成

// nの入力を受け取り、nの要素数を持つランダムな値が入った配列を返却する関数の作成を行ってください。
// また、返却される配列は値の重複がないようにしてください。
// nの入力値は1以上、1000未満としてください。

//そもそもバブルソートは何か？
//バラバラに並んでいるデータを昇順やや降順に並び替えること
//(隣のデータと比較して値を入れ替える)
//今回の場合はランダムな値を返す処理なので昇順や降順は関係ない？

//配列の値をを持った変数の宣言
    $ar = [
        '20',
        '10',
        '30',
        '70',
        '50'
    ];

//処理の流れ
//バブルソートでランダムな値を返却する関数の作成

//想定結果  $arの値をランダムに返すような処理
function bubble_sort ($array){
    // 要素分ループ処理を行う
    for($i = 0; $i < count($array); $i++) {

        //ランダムな値を返す処理

    }
}
